[
    {
        "image":"https://i.ibb.co/pXqC0zj/picture1.jpg",
        "title":"Rap legend talks about his debt to Oakland as he gets huge honor",
        "category":"local",
        "details":"Spend enough time in Oakland and you're bound to eventually hear the hefty bass line and crisp, biting flow of Too Short's Blow the Whistle. Whether it's bumping on a dance floor, blasting from classic Impalas cruising down Grand Avenue, or mingling with the sounds of picnics and barbecues during sunny days at Lake Merritt, the entire repertoire of Too Short, often stylized Too $hort, fundamentally shaped Bay Area hip-hop as we know it. Now, he'll be commemorated for his achievements on one of the streets where it all started. On Saturday, a three-block stretch of Foothill Boulevard between High Street and 47th Avenue will be renamed Too $hort Way in honor of the rapper and his impact on Oakland, the city — excuse me, the town — where he made a name for himself. I have felt like I owe a debt to Oakland, and that nothing I do will ever repay it because of the life that I was given through Oakland, Too Short told SFGATE. Born Todd Anthony Shaw, Too Short moved to Oakland from Los Angeles as a teenager, where he attended Fremont High School on the same stretch of Foothill Boulevard that will soon bear his name. There’s a few things that happened in my life that, if they didn’t happen, Too Short wouldn’t happen, and going to Fremont High is one of those things, Too Short said. “It was like our home base; we’d meet up at school and then we’d go to the house and make tapes, then we’d go out into the neighborhoods and sell the tapes.",
        "time":"2:45pm 02/05/2022"
    },
    {
        
        "id":2,
        "image":"https://i.ibb.co/yNrQBfq/picture2.jpg",
        "title":"Buried behind SF lies a tribute to the city’s quintessential tree",
        "category":"travel",
        "details":"A crowd assembled last month among the gravestones in a necropolis south of San Francisco. People huddled beneath the canopy of a seemingly everlasting 130-year-old Monterey cypress. Their ears clung to the words of a poem that was composed to celebrate the cypress, arguably the definitive San Francisco tree. It’s our official city holiday tree, the one that horticulturist John McLaren, once the superintendent of Golden Gate Park, planted in excess across San Francisco. The visitors had swapped funeral black for Blundstone boots with socks sprouting up to the calves or flowers in their hair. They were there not to mourn but to celebrate the third annual Arboretum Day, held exclusively at Cypress Lawn Memorial Park in collaboration with the town of Colma. Josh Gevertz established the annual celebration held each November. He’s the director for the Cypress Lawn Arboretum, a living collection of trees that shares land with the cemetery, just as the living and the dead mutually occupy Colma, as we locals like to say. Thankfully, you don’t need to have a loved one buried in the cemetery to appreciate this museum of trees.",
        "time":"4:15pm 05/01/2022"
    },
    {
        
        "id":3,
        "image":"https://i.ibb.co/wMnQSZL/picture3.jpg",
        "title":"We asked a Bay Area lawmaker about being dragged into Musk drama",
        "category":"politics",
        "details":"Those who followed Friday's release of the Twitter Files — a series of emails concerning Twitter's decision to suppress a New York Post story on Hunter Biden just prior to the 2020 presidential election — were treated to a surprise guest appearance from Bay Area Rep. Ro Khanna, a Democrat who represents Silicon Valley. Journalist Matt Taibbi shared screenshots of the emails in a drawn-out Twitter thread, and one such email was sent by Khanna to former Twitter executive Vijaya Gadde. In that email, Khanna said Twitter's decision violated freedom of speech principles, and that Twitter made the Biden story a bigger deal than it would have been otherwise.In a Wall Street Journal op-ed published Monday, Khanna reiterated these concerns, arguing, Although Twitter is a private actor not legally bound by the First Amendment ... Twitter has a responsibility to the public to allow the free exchange of ideas and open debate.",
        "time":"5:56pm 06/06/2021"
    },
    {
        
        "id":4,
        "image":"https://i.ibb.co/wWTp1tG/picture4.jpg",
        "title":"OpenTable names 3 SF restaurants among 'most beloved' in America",
        "category":"food",
        "details":"On the heels of the recent 2022 Michelin Guide announcements, restaurant reservation service OpenTable has released some accolades of its own. A total of five Bay Area restaurants made OpenTable's list of Top 100 Most Beloved Restaurants in America for this year. Three of these restaurants are in San Francisco: old-school red meat institution House of Prime Rib, upscale Greek restaurant Kokkari Estiatorio and waterfront Peruvian spot La Mar Cebicheria Peruana. The other two were in Napa County: Italian restaurant Bistro Don Giovanni in Napa and French eatery Bistro Jeanty in Yountville. OpenTable generated its list from more than 13 million reviews on its site between Oct. 1, 2021, and Sept. 30, 2022 — reviews that can only be written by diners who book reservations via OpenTable. A restaurant's overall score is determined by overall diner rating, user klout, total number of reviews, and regional overall rating, according to a press release. House of Prime Rib, which inspires such fervent devotion at least one diner has gotten a tattoo of the logo, has five stars and more than 13,300 reviews on OpenTable. Always excellent prime rib. Always great service. We have celebrated our Birthdays there every year for the last 34 years, raved one OpenTable reviewer. California was the state with the most restaurants on the Top 100 list, with a total of 21 across Los Angeles, San Diego, San Francisco and more.",
        "time":"4:08pm 08/12/2022"
    },
    {
        
        "id":5,
        "image":"https://i.ibb.co/hMNJCD2/picture5.jpg",
        "title":"Cold front could bring wet weather to San Francisco's SantaCon",
        "category":"weather",
        "details":"If you're planning to join the parade of drunken bearded people during San Francisco's SantaCon on Saturday, you'll want to stuff a jacket and an umbrella into your toy bag. Significant rain is expected to fall in the city on Saturday as a cold front passes over Northern California. It won't be chilly like the North Pole, with a forecast high of 57 on Saturday, but it's expected to be wet and soggy. We're expecting the rain to arrive later Friday night and push into Saturday, said Rick Canepa, a forecaster with the National Weather Service. If you're planning to join the parade of drunken bearded people during San Francisco's SantaCon on Saturday, you'll want to stuff a jacket and an umbrella into your toy bag. Significant rain is expected to fall in the city on Saturday as a cold front passes over Northern California. It won't be chilly like the North Pole, with a forecast high of 57 on Saturday, but it's expected to be wet and soggy. We're expecting the rain to arrive later Friday night and push into Saturday, said Rick Canepa, a forecaster with the National Weather Service.",
        "time":"5.01pm 07/12/2022"
    },
    {
        
        "id":6,
        "image":"https://i.ibb.co/Yf0hcZy/picture6.jpg",
        "title":"Pump the brakes: Shanahan says Jimmy G miracle return is unlikely",
        "category":"sports",
        "details":"Kyle Shanahan is cooling any sort of expectations that 49ers quarterback Jimmy Garoppolo will recover from his foot injury for the postseason. There's that way outside chance, you know, late in the playoffs or something like that, but that's just an outside chance. Shanahan told reporters on Wednesday. We're not really real optimistic about that, but they didn't rule it out, he said of the Niners' medical team. This is in the wake of reports Tuesday that Garoppolo could play in the divisional round, or even earlier, despite a previous declaration that the QB was done for the season. Shanahan directly addressed this report Wednesday, calling the timetable a “best-case scenario, and said that the range was actually for when the quarterback’s foot would be fully healed — not necessarily ready to play football. Garoppolo injured his foot during the Niners’ first drive against the Dolphins on Sunday. Rookie Brock Purdy replaced the 31-year-old and helped lead San Francisco to a 33-17 win over Miami. It’s been a dire season for the Niners in terms of quarterback health, with the team having lost two starters. Things got so bad that there were rumors of interest in Baker Mayfield. After all of the back-and-forth about the status of the bones in Garoppolo's foot, the Niners seem to be back in the same position they were during Sunday’s game: with Brock Purdy leading the offense.",
        "time":"3:33pm 04/05/2021"
    },
    {
        
        "id":7,
        "image":"https://i.ibb.co/KXJskyp/picture7.jpg",
        "title":"Meet the SF drummer at the World Cup everyone wants to know",
        "category":"travel",
        "details":"Wallace Leite from San Francisco found himself in the middle of thousands of Brazil’s most fanatic supporters during the country’s 2022 World Cup round-of-16 beatdown of South Korea, leading the fans’ chants with his infectious drum rhythms. Music and soccer go hand in hand in Brazil, Leite notes. It makes the environment very happy and energetic, he explained. And we all have fun. After Brazil won the game, fans of all nations drawn by Leite’s music, costume and ever-present smile came over to share a hug, talk and almost always take a selfie with him. “I want to go to all the World Cups, explained Leite, who had been drumming for seven hours straight by this point. I like to embrace people. I like to share with people. I like to learn from people. It’s my learning process. When the crowd thinned, Leite started walking to the stadium concourse while drumming a Brazilian rhythm. Within seconds, he once again found himself surrounded by fans dancing and celebrating Brazil’s victory. Everybody wants pictures, pictures, pictures with him because he is always smiling, he’s nice, he has a good character, added Mexico fan Francisco Javier Vargas Plata, one of Leite’s roommates in Doha, Qatar. And everybody interviews him, from Brazil and Qatar. Local media, including Qatari TV and Al Jazeera, have talked to Leite at this year’s World Cup, and even FIFA, the tournament’s organizer, had a videographer crew documenting Leite on this day. He also shares his adventure on his Instagram, Wallace das Copas. When he arrives at a World Cup game with his drum, known as a Surdo, Leite’s energy and passion for soccer open the doors, allowing him to meet fans of diverse backgrounds and nationalities together and bond over their shared love.",
        "time":"9:05pm 04/08/2021"
    },
    {
        
        "id":8,
        "image":"https://i.ibb.co/xHBBpfD/picture8.jpg",
        "title":"Highly anticipated Oakland music festival teases lineup",
        "category":"local",
        "details":"One of Oakland’s most highly-anticipated DIY music festivals of the summer is about to make its raucous return — and if acclaimed cult filmmaker and recurring host John Waters has anything to say about it, it’ll be a July 4th musical pyrotechnic display that explodes all on its own with slamming human cherry bombs, moshing punk-rock roman candles and scary screaming sparklers of every race and gender. Mosswood Meltdown, founded in 2009 and formerly known as Burger Boogaloo, is scheduled for Mosswood Park on July 1 and 2, 2023, according to an announcement released by Total Trash Productions on Tuesday. Le Tigre, the lo-fi electro punk project fronted by Kathleen Hanna of Bikini Kill, which performed at the festival in 2022, is slated to make their only Bay Area appearance and their first in the region in 15 years. Other headliners include Oakland’s own post-punk queercore band Gravy Train!!!!, bubblegum garage rockers Tina & the Total Babes, late 1990s indie pop group the Rondelles and psychedelic swamp rock band Quintron & Miss Pussycat. More bands are slated to be announced in the coming months, according to Total Trash Productions. Early bird tickets go on sale this Friday at 9 a.m., with general admission weekend passes sold at a discounted rate of $99 and VIP weekend passes for $179. ",
        "time":"8:30pm 04/03/2022"
    },
    {
        "id":9,
        "image":"https://i.ibb.co/DQtPry5/picture9.jpg",
        "title":"How to stay safe if driving to Lake Tahoe this winter",
        "category":"travel",
        "details":"Back-to-back winter storms have hit most of California's Sierra Nevada region. The area was blanketed in more than a foot of snow last week, creating an avalanche watch and leading officials to strongly discourage travel throughout the area. With the onslaught of snow still expected, visitors need to take necessary safety precautions when driving to Tahoe. We reached out to Carol Chaplin, president and CEO of the Lake Tahoe Visitors Authority for some helpful driving advice for those making the trek this season. Chaplin's number one piece of advice is simple, but essential: Always drive slower during snowy conditions. It's easy to get excited about your Tahoe visit, but give yourself time to get there slowly and safely. Plan ahead, anticipate delays and give yourself more time than you think you need. During inclement weather, you need to increase your breaking distances, even if you have a small zippy car or feel confident in the snow. Leave plenty of space — again, more than you think you need — between yourself and other vehicles.",
        "time":"3:32pm 04/08/2021"
    },
    {
        "id":10,
        "image":"https://i.ibb.co/2yw6hWp/picture10.jpg",
        "title":"Warriors forward Anthony Lamb accused of rape in civil lawsuit",
        "category":"sports",
        "details":"Warriors forward Anthony Lamb raped Kendall Ware when the two were students at the University of Vermont, Ware alleges in a civil lawsuit she and two other women filed against the university. Ware and the other plaintiffs say that university had a deliberate indifference to sexual assault. The case was filed in U.S. District Court in Burlington, Vermont, and was first reported by Vermont publication Seven Days on Wednesday night. It names the University of Vermont, its board of trustees and several administrators, including athletic director Jeff Schulman, as defendants. SFGATE, like most other major news organizations, does not typically name victims of sexual assault. Ware has spoken extensively about her experience previously and came forward as a plaintiff in this suit. Ware has publicly said that she was raped by a star athlete while she was a swimmer at the University of Vermont, previously describing an incident with a men’s basketball player at the university in media accounts and a since-withdrawn lawsuit against the NCAA. But she has not publicly named Lamb before. An anonymous Instagram account had previously named Lamb, but the lawsuit is the first time Ware has done so. Warriors president Bob Myers addressed the allegations when the team added Lamb this fall. We checked with the NBA, we checked with the two teams that had prior signed him and didn't hear anything as far as official charges or anything like that, Myers said in October. It’s tough because we take that very seriously. Myers added that if the NBA had told the Warriors not to sign Lamb, they would have listened to the league office. Anthony is not a defendant in this recent lawsuit and, to our knowledge, he has never been charged with any wrongdoing in any legal case, the Warriors said in a statement to SFGATE on Thursday. Prior to signing Anthony in September, we did our due diligence with the NBA and his prior teams, as we do with all players. If any new information comes to light, we will certainly evaluate it and act accordingly. Earlier this year, the University of Vermont rejected a public records request from SFGATE, citing attorney-client privilege and state laws exempting “student records and personal documents. ",
        "time":"7:00pm 03/07/2022"
    }
]