{
    "format": "layers-model",
    "generatedBy": "keras v2.11.0",
    "convertedBy": "TensorFlow.js Converter v4.2.0",
    "modelTopology": {
        "keras_version": "2.11.0",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Functional",
            "config": {
                "name": "model_5",
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                500
                            ],
                            "dtype": "float32",
                            "sparse": false,
                            "ragged": false,
                            "name": "input_7"
                        },
                        "name": "input_7",
                        "inbound_nodes": []
                    },
                    {
                        "class_name": "Embedding",
                        "config": {
                            "name": "embedding_6",
                            "trainable": false,
                            "batch_input_shape": [
                                null,
                                500
                            ],
                            "dtype": "float32",
                            "input_dim": 98818,
                            "output_dim": 50,
                            "embeddings_initializer": {
                                "class_name": "RandomUniform",
                                "config": {
                                    "minval": -0.05,
                                    "maxval": 0.05,
                                    "seed": null
                                }
                            },
                            "embeddings_regularizer": null,
                            "activity_regularizer": null,
                            "embeddings_constraint": null,
                            "mask_zero": false,
                            "input_length": 500
                        },
                        "name": "embedding_6",
                        "inbound_nodes": [
                            [
                                [
                                    "input_7",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Dropout",
                        "config": {
                            "name": "dropout_6",
                            "trainable": true,
                            "dtype": "float32",
                            "rate": 0.2,
                            "noise_shape": null,
                            "seed": null
                        },
                        "name": "dropout_6",
                        "inbound_nodes": [
                            [
                                [
                                    "embedding_6",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Conv1D",
                        "config": {
                            "name": "conv1d_12",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 64,
                            "kernel_size": [
                                5
                            ],
                            "strides": [
                                1
                            ],
                            "padding": "valid",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv1d_12",
                        "inbound_nodes": [
                            [
                                [
                                    "dropout_6",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Conv1D",
                        "config": {
                            "name": "conv1d_13",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 64,
                            "kernel_size": [
                                5
                            ],
                            "strides": [
                                1
                            ],
                            "padding": "valid",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv1d_13",
                        "inbound_nodes": [
                            [
                                [
                                    "dropout_6",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "MaxPooling1D",
                        "config": {
                            "name": "max_pooling1d_12",
                            "trainable": true,
                            "dtype": "float32",
                            "strides": [
                                4
                            ],
                            "pool_size": [
                                4
                            ],
                            "padding": "valid",
                            "data_format": "channels_last"
                        },
                        "name": "max_pooling1d_12",
                        "inbound_nodes": [
                            [
                                [
                                    "conv1d_12",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "MaxPooling1D",
                        "config": {
                            "name": "max_pooling1d_13",
                            "trainable": true,
                            "dtype": "float32",
                            "strides": [
                                4
                            ],
                            "pool_size": [
                                4
                            ],
                            "padding": "valid",
                            "data_format": "channels_last"
                        },
                        "name": "max_pooling1d_13",
                        "inbound_nodes": [
                            [
                                [
                                    "conv1d_13",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Bidirectional",
                        "config": {
                            "name": "bidirectional_2",
                            "trainable": true,
                            "dtype": "float32",
                            "layer": {
                                "class_name": "LSTM",
                                "config": {
                                    "name": "lstm_7",
                                    "trainable": true,
                                    "dtype": "float32",
                                    "return_sequences": false,
                                    "return_state": false,
                                    "go_backwards": false,
                                    "stateful": false,
                                    "unroll": false,
                                    "time_major": false,
                                    "units": 64,
                                    "activation": "tanh",
                                    "recurrent_activation": "sigmoid",
                                    "use_bias": true,
                                    "kernel_initializer": {
                                        "class_name": "GlorotUniform",
                                        "config": {
                                            "seed": null
                                        },
                                        "shared_object_id": 12
                                    },
                                    "recurrent_initializer": {
                                        "class_name": "Orthogonal",
                                        "config": {
                                            "gain": 1.0,
                                            "seed": null
                                        },
                                        "shared_object_id": 13
                                    },
                                    "bias_initializer": {
                                        "class_name": "Zeros",
                                        "config": {},
                                        "shared_object_id": 14
                                    },
                                    "unit_forget_bias": true,
                                    "kernel_regularizer": null,
                                    "recurrent_regularizer": null,
                                    "bias_regularizer": null,
                                    "activity_regularizer": null,
                                    "kernel_constraint": null,
                                    "recurrent_constraint": null,
                                    "bias_constraint": null,
                                    "dropout": 0.0,
                                    "recurrent_dropout": 0.0,
                                    "implementation": 2
                                }
                            },
                            "merge_mode": "concat"
                        },
                        "name": "bidirectional_2",
                        "inbound_nodes": [
                            [
                                [
                                    "max_pooling1d_12",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Bidirectional",
                        "config": {
                            "name": "bidirectional_3",
                            "trainable": true,
                            "dtype": "float32",
                            "layer": {
                                "class_name": "LSTM",
                                "config": {
                                    "name": "lstm_8",
                                    "trainable": true,
                                    "dtype": "float32",
                                    "return_sequences": false,
                                    "return_state": false,
                                    "go_backwards": false,
                                    "stateful": false,
                                    "unroll": false,
                                    "time_major": false,
                                    "units": 64,
                                    "activation": "tanh",
                                    "recurrent_activation": "sigmoid",
                                    "use_bias": true,
                                    "kernel_initializer": {
                                        "class_name": "GlorotUniform",
                                        "config": {
                                            "seed": null
                                        },
                                        "shared_object_id": 18
                                    },
                                    "recurrent_initializer": {
                                        "class_name": "Orthogonal",
                                        "config": {
                                            "gain": 1.0,
                                            "seed": null
                                        },
                                        "shared_object_id": 19
                                    },
                                    "bias_initializer": {
                                        "class_name": "Zeros",
                                        "config": {},
                                        "shared_object_id": 20
                                    },
                                    "unit_forget_bias": true,
                                    "kernel_regularizer": null,
                                    "recurrent_regularizer": null,
                                    "bias_regularizer": null,
                                    "activity_regularizer": null,
                                    "kernel_constraint": null,
                                    "recurrent_constraint": null,
                                    "bias_constraint": null,
                                    "dropout": 0.0,
                                    "recurrent_dropout": 0.0,
                                    "implementation": 2
                                }
                            },
                            "merge_mode": "concat"
                        },
                        "name": "bidirectional_3",
                        "inbound_nodes": [
                            [
                                [
                                    "max_pooling1d_13",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Concatenate",
                        "config": {
                            "name": "concatenate_5",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": -1
                        },
                        "name": "concatenate_5",
                        "inbound_nodes": [
                            [
                                [
                                    "bidirectional_2",
                                    0,
                                    0,
                                    {}
                                ],
                                [
                                    "bidirectional_3",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_5",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 2,
                            "activation": "softmax",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "dense_5",
                        "inbound_nodes": [
                            [
                                [
                                    "concatenate_5",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    }
                ],
                "input_layers": [
                    [
                        "input_7",
                        0,
                        0
                    ]
                ],
                "output_layers": [
                    [
                        "dense_5",
                        0,
                        0
                    ]
                ]
            }
        },
        "training_config": {
            "loss": "sparse_categorical_crossentropy",
            "metrics": [
                "accuracy"
            ],
            "loss_weights": null,
            "sample_weight_mode": null,
            "weighted_metrics": null,
            "optimizer_config": {
                "class_name": "Adam",
                "config": {
                    "name": "Adam",
                    "learning_rate": 0.0010000000474974513,
                    "decay": 0.0,
                    "beta_1": 0.8999999761581421,
                    "beta_2": 0.9990000128746033,
                    "epsilon": 1e-07,
                    "amsgrad": false
                }
            }
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of5.bin",
                "group1-shard2of5.bin",
                "group1-shard3of5.bin",
                "group1-shard4of5.bin",
                "group1-shard5of5.bin"
            ],
            "weights": [
                {
                    "name": "bidirectional_2/forward_lstm_7/lstm_cell_15/kernel",
                    "shape": [
                        64,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "bidirectional_2/forward_lstm_7/lstm_cell_15/recurrent_kernel",
                    "shape": [
                        64,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "bidirectional_2/forward_lstm_7/lstm_cell_15/bias",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "bidirectional_2/backward_lstm_7/lstm_cell_16/kernel",
                    "shape": [
                        64,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "bidirectional_2/backward_lstm_7/lstm_cell_16/recurrent_kernel",
                    "shape": [
                        64,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "bidirectional_2/backward_lstm_7/lstm_cell_16/bias",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "bidirectional_3/forward_lstm_8/lstm_cell_18/kernel",
                    "shape": [
                        64,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "bidirectional_3/forward_lstm_8/lstm_cell_18/recurrent_kernel",
                    "shape": [
                        64,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "bidirectional_3/forward_lstm_8/lstm_cell_18/bias",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "bidirectional_3/backward_lstm_8/lstm_cell_19/kernel",
                    "shape": [
                        64,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "bidirectional_3/backward_lstm_8/lstm_cell_19/recurrent_kernel",
                    "shape": [
                        64,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "bidirectional_3/backward_lstm_8/lstm_cell_19/bias",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv1d_12/kernel",
                    "shape": [
                        5,
                        50,
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv1d_12/bias",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv1d_13/kernel",
                    "shape": [
                        5,
                        50,
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv1d_13/bias",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_5/kernel",
                    "shape": [
                        256,
                        2
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_5/bias",
                    "shape": [
                        2
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "embedding_6/embeddings",
                    "shape": [
                        98818,
                        50
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}